Revit 2024 API
RebarHostData.SetCoverType Method
 Associates the specified CoverType with the specified face of the element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetCoverType(
	Reference face,
	RebarCoverType coverType
)
Visual Basic
Public Sub SetCoverType ( _
	face As Reference, _
	coverType As RebarCoverType _
)
Visual C++
public:
void SetCoverType(
	Reference^ face,
	RebarCoverType^ coverType
)
Parameters
face
Type: Autodesk.Revit.DB.Reference
coverType
Type: Autodesk.Revit.DB.Structure.RebarCoverType
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  In this element, face does not have an associated CoverType, because it is not exposed.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace